tom38121605/sample_mcu_STM32C011F6_all/_20_01_cubeide_uart_led示例_ok/ommocom-128-af-softreset-bootload-ready-to-github-V20240511-k-kp/Core/Src/main.c
#define FLASH_EEPROM_START_PAGE         15   
#define FLASH_EEPROM_START_ADDR    ( (uint32_t)(FLASH_BASE_ADDR + FLASH_EEPROM_START_PAGE * FLASH_PAGESIZE) )   //7800

#define MAX_EEPROMDATALEN   ( (16- FLASH_EEPROM_START_ADDR)*FLASH_PAGESIZE )   //1*0x800
#define MAX_BINFILEDATALEN   ( (FLASH_BOOTFLAG_START_PAGE- FLASH_OFFSET_START_PAGE)*FLASH_PAGESIZE )  //(14-6)*0x800

static FLASH_EraseInitTypeDef EraseInitStruct;
uint32_t iflashaddr = 0;
uint32_t PageError = 0;

#define DO_BOOTLOAD_FLG  0xaaaa5555


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

void delay_nop(uint32_t nCount) 
{ 
   for(; nCount != 0; nCount--)  
   { 
      __NOP(); 
   } 
}

void iputs1(char *msg)
{
   while(*msg)
   Send_Data_To_UART1(*msg++);   
}


void iputbytes1(uint8_t *msg, uint32_t ilen)
{
   while(ilen--)
   Send_Data_To_UART1(*msg++);
}

void Send_Data_To_UART1 (uint8_t c)
{
   USART1->TDR = c;
   while( (USART1-> ISR & (1<<7) ) ==0 );
}


uint8_t get_checksum_8(uint8_t *ival, uint32_t inum)
{
   uint32_t i =0;
   uint8_t iret =0;
   uint16_t isum =0;

   for (i=0; i<inum; i++)
   {
      isum += ival[i]; 
   }

   iret = (uint8_t)(isum & 0xff);

   return iret;
}

uint8_t SPI_transfer(uint8_t data)
{
   // transmit
	LL_SPI_TransmitData8(MMC_SPI, data);
	while(!LL_SPI_IsActiveFlag_TXE(MMC_SPI));

   // receive
	while(!LL_SPI_IsActiveFlag_RXNE(MMC_SPI));
	return LL_SPI_ReceiveData8(MMC_SPI);

}


//---------------------mmc0 module---------------------------

uint8_t mmc0_read_byte(uint8_t addr)
{
   uint8_t value;

   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);

   SPI_transfer(0x80|addr );
   value  = SPI_transfer(0x00);

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);

   return value;
}

void mmc0_write_byte(uint8_t addr,  uint8_t value)
{
 
   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);

   SPI_transfer(addr);
   SPI_transfer(value);

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);
 
}

void mmc0_read_bytes(uint8_t addr ,uint8_t length ,uint8_t *buffer)
{
   for(int index = 0; index < length; index++)
   {
       buffer[index]  = mmc0_read_byte(addr+index);
   } 
 
}

void mmc0_readfromspi( uint8_t iaddr, uint8_t ilen, uint8_t *idata)
{
 
   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);      

   SPI_transfer(0x80 |iaddr);

   while(ilen--)
   {
       *idata  = SPI_transfer(0x00);
       idata++;
   }

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);
 
}

void mmc0_init(void)
{
   uint8_t ivalue=0;

   //check device id
   ivalue = mmc0_read_byte(MMC5983_PRODUCT_ID_REG);  //read id    
   if(ivalue == MMC5983_PRODUCT_ID_RESULT)  //device id
   {
      //iputs1("mmc0 ok");       
      //flg_mmc0_ready=1;    

////      //unfrozen test  
////      mmc0_write_byte(MMC5983_CONTROL0_REG,MMC5983_CONTROL0_AUTOSREN|MMC5983_CONTROL0_INT_EN);      //auto ser/reset, enable interrupt    
////      mmc0_write_byte(MMC5983_CONTROL2_REG,MMC5983_CONTROL2_CM_FREQ_1000| MMC5983_CONTROL2_CMM_EN); //1000Hz, continuous mode
////      LL_mDelay(1);   
////      mmc0_write_byte(MMC5983_CONTROL0_REG,MMC5983_CONTROL0_INIT);   //0  
////      immc0_ctrl_0=MMC5983_CONTROL0_INIT;	
////      mmc0_write_byte(MMC5983_CONTROL2_REG, 0x00);         

      //reset   
      mmc0_write_byte(MMC5983_CONTROL1_REG,MMC5983_CONTROL1_CHIP_RESET);  //reset
      LL_mDelay(20);        
      
      //set control 0  
      mmc0_write_byte(MMC5983_CONTROL0_REG,MMC5983_CONTROL0_INIT);   //0  
      immc0_ctrl_0=MMC5983_CONTROL0_INIT;			
       
      //set control 1   
      mmc0_write_byte(MMC5983_CONTROL1_REG,MMC5983_CONTROL1_BW_800);    //800Hz
    
   }
   else
   {
       //flg_mmc0_ready=0;
       //iputs1("mmc0 err");   
   }     
   
}

void mmc0_read_data(uint8_t *sdata, uint8_t ilen)
{
   static uint32_t ireadcount = 0;
 
   //start sample 
   //mmc0_write_byte(MMC5983_CONTROL0_REG, immc0_ctrl_0 & 0x7f); 
   //mmc0_write_byte(MMC5983_CONTROL0_REG, MMC5983_CONTROL0_MAG_MEAS);    //sample   

   //read data
   mmc0_readfromspi(MMC5983_XOUT_REG, ilen, sdata);   

   //set/reset + Temp command
   if (ireadcount>=1000)
   {
      ireadcount =0;

      mmc0_write_byte(MMC5983_CONTROL0_REG, immc0_ctrl_0 & 0x7f);            
      mmc0_write_byte(MMC5983_CONTROL0_REG, MMC5983_CONTROL0_TEMP_MEAS | MMC5983_CONTROL0_RESET ); 
      mmc0_write_byte(MMC5983_CONTROL1_REG, MMC5983_CONTROL1_BW_800);    //800Hz   
        
   }        
}    


//---------------------mmc0 module----end-----------------------


//---------------------mmc1 module---------------------------

uint8_t mmc1_read_byte(uint8_t addr)
{
   uint8_t value;

   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);

   SPI_transfer(0x80|addr );
   value  = SPI_transfer(0x00);

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);

   return value;
}

void mmc1_write_byte(uint8_t addr,  uint8_t value)
{ 
   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);

   SPI_transfer(addr);
   SPI_transfer(value);

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);
}

void mmc1_read_bytes(uint8_t addr ,uint8_t length ,uint8_t *buffer)
{
   //read data
   for(int index = 0; index < length; index++)
   {
      buffer[index]  = mmc1_read_byte(addr+index);
   } 
 
}

void mmc1_readfromspi( uint8_t iaddr, uint8_t ilen, uint8_t *idata)
{ 
   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);      

   SPI_transfer(0x80 |iaddr);

   while(ilen--)
   {
      *idata  = SPI_transfer(0x00);
      idata++;
   }

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);
}
 

void mmc1_init(void)
{
   uint8_t ivalue=0;   

   //check device id
   ivalue = mmc1_read_byte(MMC5983_PRODUCT_ID_REG);  //read id    
   if(ivalue == MMC5983_PRODUCT_ID_RESULT)  //device id
   {
      //iputs1("mmc1 ok");       
      //flg_mmc1_ready=1;   

