tom38121605/sample_mcu_STM32C011F6_all/_20_01_cubeide_uart_led示例_ok/ommocom-128-af-softreset-bootload-ready-to-github-V20240511-k-kp/Core/Src/main.c
}   

void dowithuart(void)
{   
   uint16_t itimnum=0;
   uint32_t ipackdatalen=0;
//   uint8_t stest[20]={0};
   uint32_t icrc=0;
   uint32_t icrclen=0;
   uint32_t icrcin=0;  
   static uint32_t icrcstep=0;
   
   switch (irxdata2[3])   //command
   {
      case 0x61:   //bootload command
         
         //set bootload flag
      
         // ------------- write flash -----------------

         //erease flash 
         HAL_FLASH_Unlock();

         __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR);

         EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
         EraseInitStruct.Page        = FLASH_BOOTFLAG_START_PAGE;     // 14
         EraseInitStruct.NbPages     = 1;                             // 1 x 800    

         if (HAL_FLASHEx_Erase(&EraseInitStruct, &PageError) != HAL_OK)
         {
            ;//uartsendcmd( (uint8_t*)"erase flash err\r\n", 17);     
         } 
         
         //write flash
         if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, FLASH_BOOTFLAG_START_ADDR, 0xffffffff00000000+DO_BOOTLOAD_FLG ) != HAL_OK)
         {
            ;//uartsendcmd( (uint8_t*)"write flash err\r\n", 17);  
         }   
         
         //read flash
         //idata32 = *(__IO uint32_t *)(0x8007000);
         //uartsendcmd( (uint8_t*)(&idata32), 4);
         
         HAL_FLASH_Lock();        
      
         //soft reser
         __set_PRIMASK(1);
         software_reset();    
      
         break;      
      
      case 0xA1:
        
         readsensor();   
       
         slavecmd[0]=CMDHEADER1;    //0xAA;
         slavecmd[1]=CMDHEADER2;    //0x55;
         slavecmd[2]=0x1F;         
         slavecmd[3]=0xB1;          
         slavecmd[4]=LOCALSLAVEADDR;          
      
         itimnum = LL_TIM_GetCounter(TIM17);
         slavecmd[ DATA_TIME_POINT] = (uint8_t)(itimnum & 0xff);
         slavecmd[ DATA_TIME_POINT+1] = (uint8_t)( (itimnum>>8) & 0xff );   
   
         slavecmd[33]=get_checksum_8(slavecmd,33);
         uartsendcmd(slavecmd,34);      
        
         break;
      
      case 0xC1:    
           
            // erease the flash
            HAL_FLASH_Unlock();

            __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR);

            EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
            EraseInitStruct.Page        = FLASH_EEPROM_START_PAGE;          //15,        //7800
            EraseInitStruct.NbPages     = 1;                         //1 x 800   

            if (HAL_FLASHEx_Erase(&EraseInitStruct, &PageError) != HAL_OK)
            {
               uartsendcmd( (uint8_t*)"erase flash err\r\n", 17);     
            } 
            HAL_FLASH_Lock();             
            
            //response command D1
            slavecmd[0]=CMDHEADER1;     //0xAA;
            slavecmd[1]=CMDHEADER2;     //0x55;
            slavecmd[2]=0x03;           //len
            slavecmd[3]=0xD1;           //command
            slavecmd[4]=LOCALSLAVEADDR;   //local addr         
            slavecmd[5]=get_checksum_8(slavecmd,5);
            uartsendcmd(slavecmd,6);     
            
            
            iflashaddr = FLASH_EEPROM_START_ADDR;   //0800 3000
            idataoff =0;    
            istepdatalen=0;
            icrcstep=LL_CRC_DEFAULT_CRC_INITVALUE; 
            ialldatalen=0;       
      
            break;

      case 0xC2:  
      
            ipackdatalen=irxdata2[2]-3;
      
            if( (ialldatalen+ipackdatalen) > MAX_EEPROMDATALEN)
            {
               uartsendcmd( (uint8_t*)"max data err\r\n", 14);  
               break;               
            }        
      
            if( (idataoff+ipackdatalen) > PAGE_DATA_SIZE)
            {
               uartsendcmd( (uint8_t*)"data err\r\n", 10);  
               break;               
            }
      
            //copy to array
            for( uint32_t i=0; i<ipackdatalen; i++)
            {
               FLASHTEMPDATA[idataoff+i]=irxdata2[5+i];
            }
            
            idataoff += ipackdatalen; 
            
            //------------------save to flash--------------------
            
            if( idataoff == PAGE_DATA_SIZE)
            {      
               //make step crc 
               istepdatalen=idataoff;
               icrclen=byte2uint32( (uint8_t *)FLASHTEMPDATA,icrctempdata,istepdatalen);   
               
               //icrc = stm32_crc32(icrctempdata, icrclen);  
               icrc = stm32_crc32ex(icrctempdata, icrclen, icrcstep); 
                
               HAL_FLASH_Unlock();               

               for(uint32_t i=0; i<istepdatalen; i+=8)
               {
                  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, iflashaddr, *(uint64_t*)(&FLASHTEMPDATA[i]) ) == HAL_OK)
                  {
                     iflashaddr += 8;  //move 8 bytes
                  }
                  else
                  {
                     uartsendcmd( (uint8_t*)"save flash err\r\n", 16);  
                  }               
               }           

               HAL_FLASH_Lock();  

               icrcstep=icrc;
               ialldatalen+=istepdatalen;  //idataoff
               idataoff=0;
            }                      
            //------------------save to flash-----end---------------
            
            
            //response command D2
            slavecmd[0]=CMDHEADER1;  //0xAA;
            slavecmd[1]=CMDHEADER2;  //0x55;
            slavecmd[2]=0x03;       
            slavecmd[3]=0xD2;      
            slavecmd[4]=LOCALSLAVEADDR;         
            slavecmd[5]=get_checksum_8(slavecmd,5);
            uartsendcmd(slavecmd,6);                 
            
            break;

      case 0xC3:
         
            //------------------save to flash--------------------
            
            if( idataoff < PAGE_DATA_SIZE)
            {      
               
               uint8_t iremainder=0;
               iremainder= idataoff % 8;   
               if(iremainder!=0)
                   memset(FLASHTEMPDATA+idataoff,0xff,8-iremainder);                
               
               //make step crc 
               istepdatalen=idataoff;
               icrclen=byte2uint32( (uint8_t *)FLASHTEMPDATA,icrctempdata,istepdatalen);   
               
               //icrc = stm32_crc32(icrctempdata, icrclen);  
               icrc = stm32_crc32ex(icrctempdata, icrclen, icrcstep); 
                
