tom38121605/sample_mcu_STM32C011F6_all/_20_01_cubeide_uart_led示例_ok/ommocom-128-af-softreset-bootload-ready-to-github-V20240511-k-kp/Core/Src/main.c
               HAL_FLASH_Unlock();               

               for(uint32_t i=0; i<istepdatalen; i+=8)
               {
                  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, iflashaddr, *(uint64_t*)(&FLASHTEMPDATA[i]) ) == HAL_OK)
                  {
                     iflashaddr += 8;  //move 8 bytes
                  }
                  else
                  {
                     uartsendcmd( (uint8_t*)"save flash err\r\n", 8);  
                  }               
               }           

               HAL_FLASH_Lock();  

               icrcstep=icrc;
               ialldatalen+=istepdatalen;  //idataoff
               idataoff=0;
            }                      
            //------------------save to flash-----end---------------   
      
      
            //check crc
            icrcin+=(uint32_t)(irxdata2[5]<<24);
            icrcin+=(uint32_t)(irxdata2[6]<<16);
            icrcin+=(uint32_t)(irxdata2[7]<<8);
            icrcin+=(uint32_t)(irxdata2[8]);
      
            if(icrcstep==icrcin)   
            {
               slavecmd[0]=CMDHEADER1;  //0xAA;
               slavecmd[1]=CMDHEADER2;  //0x55;
               slavecmd[2]=0x03;       
               slavecmd[3]=0xD3;      
               slavecmd[4]=LOCALSLAVEADDR;         
               slavecmd[5]=get_checksum_8(slavecmd,5);
               uartsendcmd(slavecmd,6);     
            }  
            else
            {
               slavecmd[0]=CMDHEADER1;  //0xAA;
               slavecmd[1]=CMDHEADER2;  //0x55;
               slavecmd[2]=0x03;       
               slavecmd[3]=0xE3;      
               slavecmd[4]=LOCALSLAVEADDR;         
               slavecmd[5]=get_checksum_8(slavecmd,5);
               uartsendcmd(slavecmd,6);   

               break;               
            } 

////--test
//uartsendcmd( (uint8_t*)(&ialldatalen), 4);             
            
            //-------------------read out the flash data -------------------            
            
            memset(FLASHTEMPDATA,0,PAGE_DATA_SIZE);  
            iflashaddr = FLASH_EEPROM_START_ADDR;        //0800 3000
            icrcstep=LL_CRC_DEFAULT_CRC_INITVALUE; 
                 
            //uint32_t ipage=0;            
            while( ialldatalen>0 )    
            {                
               
               if(ialldatalen >= PAGE_DATA_SIZE)
                  istepdatalen = PAGE_DATA_SIZE;
               else
                  istepdatalen = ialldatalen;  
               
                              
               for(uint32_t j=0; j<istepdatalen; j+=4)      
                  *(__IO uint32_t *)( &FLASHTEMPDATA[j] ) = *(__IO uint32_t *)(iflashaddr+j); 
               
               
               //make step crc 
               icrclen=byte2uint32( (uint8_t *)FLASHTEMPDATA,icrctempdata,istepdatalen);   
               
               //icrc = stm32_crc32(icrctempdata, icrclen);  
               icrc = stm32_crc32ex(icrctempdata, icrclen, icrcstep);  

               //uartsendcmd( FLASHTEMPDATA, istepdatalen);       //--test log             
               
               //ipage++;
               icrcstep=icrc;
               ialldatalen -= istepdatalen;
               iflashaddr += istepdatalen;
               istepdatalen = 0;  
               
            }           
                             
            if(icrc!=icrcin) 
                uartsendcmd( (uint8_t*)"crc err\r\n", 9);       

            //-------------------read out the flash data ---end----------------   
            

//---test log ---                 

////delay_nop(WAIT2TE_SLAVE); 
////switch2send(USART1);
////Send_Data_To_UART1(icrc>>24);
////Send_Data_To_UART1(icrc>>16);
////Send_Data_To_UART1(icrc>>8);
////Send_Data_To_UART1(icrc>>0);       
////delay_nop(WAIT2RE_SLAVE);  
////switch2read(USART1);                 
//////uartsendcmd( (uint8_t*)(&icrc), 4); 

//////run new firmware            
////LL_mDelay(15000);
////USART1->CR1 |=(1<<2);
////USART1->CR1 |=(1<<3);
////LL_mDelay(200);
////iap_load_app(FLASH_EEPROM_START_ADDR);


            break;

      default:         
            break;
   } 
       
}

void mmc0_mmc1_start_sample(void)
{
   //start mmc0 mmc1 sample 
   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);  //mmc0
   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);  //mmc1

//   SPI_transfer(MMC5983_CONTROL0_REG);    
//   SPI_transfer(MMC5983_CONTROL0_INIT & 0x7f);    
   

//   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);  //mmc0
//   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);  //mmc1 
//   
//   //start measure
//   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);  //mmc0
//   LL_GPIO_ResetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);  //mmc1
   
   
   SPI_transfer(MMC5983_CONTROL0_REG); 
   SPI_transfer(MMC5983_CONTROL0_MAG_MEAS);    

   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_3);  //mmc0
   LL_GPIO_SetOutputPin((GPIO_TypeDef *)GPIOA, LL_GPIO_PIN_4);  //mmc1 

   
} 

void readsensor(void)
{
   memset(slavecmd,0,28);   
   
   mmc0_mmc1_start_sample();
   
   mmc0_read_data(slavecmd+DATA_MMC0_POINT,7);    
   mmc1_read_data(slavecmd+DATA_MMC1_POINT,7);  
   
   icm0_read_data(slavecmd+DATA_ICM0_POINT,12);   
} 


uint32_t byte2uint32(uint8_t *strin, uint32_t *strout, uint32_t ilen)
{

   uint32_t i = 0;
   uint32_t iret = 0;

   //get crc adder
   for ( i=0; i<(ilen/4); i++)
   {
      strout[i] = (uint32_t)((strin[4*i] << 24) | (strin[4*i+1] << 16) | (strin[4*i+ 2] << 8) | strin[4*i+3]);
   }

   //last word
   if ( (ilen%4) == 3)
      strout[i] = (uint32_t)((strin[4*i] << 24) | (strin[4*i+1] << 16) | (strin[4*i+ 2] << 8) );
   if ( (ilen%4) == 2) 
      strout[i] = (uint32_t)((strin[4*i] << 24) | (strin[4*i+1] << 16) );
   if ( (ilen%4) == 1)
      strout[i] = (uint32_t)((strin[4*i] << 24) );
   
   
   //get crc len
   if( (ilen%4) ==0)
      iret =  ilen/4;
   else
      iret = ilen/4 +1;
   
   return iret;
}


uint32_t calcu_crc32(uint32_t *idatain, uint32_t len)
{
   uint32_t icrc_poly = 0x04C11DB7;  
   uint32_t icrc_out = 0xffffffff;  

   for(uint32_t i = 0; i < len; i++)
   {
      icrc_out ^= idatain[i];  

      for (uint8_t j = 0; j < 32; j++)
      {
         if (icrc_out & 0x80000000)
            icrc_out = (icrc_out << 1) ^ icrc_poly;
         else
            icrc_out <<= 1;
      }
   }
   
