tom38121605/sample_mcu_STM32C011F6_all/_20_01_cubeide_uart_led示例_ok/ommocom-128-af-softreset-bootload-ready-to-github-V20240511-k-kp/Core/Src/main.c
   return (icrc_out);
}


uint32_t calcu_crc32ex(uint32_t *idatain, uint32_t len, uint32_t icrc_in)
{
   uint32_t icrc_poly = 0x04C11DB7;  
   uint32_t icrc_out = icrc_in;  

   for(uint32_t i = 0; i < len; i++)
   {
      icrc_out ^= idatain[i];        
      
      //Send_Data_To_UART1(i);  //test

      for (uint8_t j = 0; j < 32; j++)
      {
         if (icrc_out & 0x80000000)
            icrc_out = (icrc_out << 1) ^ icrc_poly;
         else
            icrc_out <<= 1;
      }
   }
   
   return (icrc_out);
}

uint32_t stm32_crc32(uint32_t *idatain, uint32_t len)
{
//   register uint32_t data = 0;
//   register uint32_t index = 0;
   
   LL_CRC_SetInitialData(CRC, LL_CRC_DEFAULT_CRC_INITVALUE);

   for(uint32_t i = 0; i < len; i++)
   {
      LL_CRC_FeedData32(CRC,  idatain[i]);
   }

   return (LL_CRC_ReadData32(CRC));
}

uint32_t stm32_crc32ex(uint32_t *idatain, uint32_t len, uint32_t icrc_in)
{
//   register uint32_t data = 0;
//   register uint32_t index = 0;
   
   LL_CRC_SetInitialData(CRC, icrc_in);

   for(uint32_t i = 0; i < len; i++)
   {
      LL_CRC_FeedData32(CRC,  idatain[i]);
   }

   return (LL_CRC_ReadData32(CRC));
}

//---------------------bootload ---------------------------

typedef void (*iapfun)(void);
iapfun jump2app;

void MSR_MSP(uint32_t addr)
{   
   __ASM("MSR MSP, r0");  
   __ASM(" BX r14");  
   
//   __ASM("msr msp, r0");  
//   __ASM("bx lr");  
}


void iap_load_app(uint32_t appxaddr)
{ 
   if(((*(__IO uint32_t*)appxaddr)&0x2FFE0000)==0x20000000)  
   {  
      jump2app=(iapfun)*(__IO uint32_t*)(appxaddr+4);  
      //MSR_MSP(*(__IO uint32_t*)appxaddr);  
      jump2app();  

   }      
}

//---------------------bootload ----end-----------------------


void software_reset(void)
{
   NVIC_SystemReset();
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

   //SCB->VTOR = FLASH_BASE_ADDR + FLASH_OFFSET_START_PAGE * FLASH_PAGESIZE;    //VECT_TAB_OFFSET

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);

  /* SysTick_IRQn interrupt configuration */
  NVIC_SetPriority(SysTick_IRQn, 3);

  LL_SYSCFG_EnablePinRemap(LL_SYSCFG_PIN_RMP_PA11);
  LL_SYSCFG_EnablePinRemap(LL_SYSCFG_PIN_RMP_PA12);

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */


  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_TIM1_Init();
  MX_SPI1_Init();
  MX_TIM17_Init();
  MX_CRC_Init();
  /* USER CODE BEGIN 2 */
    
   LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_SYSCLK, LL_RCC_MCO1_DIV_4);   //12Mhz = 48Mhz/4


   LL_mDelay(10);  //20
   uartsendcmd( (uint8_t*)"start",5);     //start  
   
   LL_SPI_Enable(SPI1);     

   //sensor init 
   mmc0_init();
   mmc1_init();
   icm0_init();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
    
   while (1)
   { 
      static uint32_t iuart_rxledcount=0;
      static uint32_t isensorcount=0;
      static uint32_t iresetcount=0;
      uint8_t ichecksum=0;      

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

      if(flg_timer1==1)
      {
         flg_timer1=0;
       
         iuart_rxledcount++;	
         isensorcount++;
         
         iresetcount++;
      }             
      
      //uart rx
      if (flg_rx==1)
      {
         flg_rx=0;   
         //uartsendcmd( (uint8_t*)"rx in\r\n",7); 

         islaveaddrin=irxdata2[4];

         //checksum
         ichecksum = get_checksum_8((uint8_t *)irxdata2,irxcount2-1);

         if(ichecksum == irxdata2[irxcount2-1])  
            if(islaveaddrin==LOCALSLAVEADDR)            
               dowithuart(); 
         
      }   
      
////      //read sensor data
////      if(isensorcount>=1)   //1* 1ms =1ms
////      {
////         isensorcount=0;  
////         //readsensor(); 
////      }	
      
      //test softreset
      if(isensorcount>=10000)    
      {
         isensorcount=0;  
         //readsensor(); 
         
      }	      
      
      
      if(iresetcount>=1000)
      {
         iresetcount=0;
         
         //do control0 reset
         mmc0_write_byte(MMC5983_CONTROL0_REG, MMC5983_CONTROL0_RESET );   
         mmc1_write_byte(MMC5983_CONTROL0_REG, MMC5983_CONTROL0_RESET );
      }      
 
		if( iuart_rxledcount >=1000)
		{	
			 iuart_rxledcount=0;		 
			 LL_GPIO_TogglePin( LED_GPIO_Port, LED_Pin);
		}
 
  }  

  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  LL_FLASH_SetLatency(LL_FLASH_LATENCY_1);

  /* HSI configuration and activation */
  LL_RCC_HSI_Enable();
  while(LL_RCC_HSI_IsReady() != 1)
  {
  }

  LL_RCC_HSI_SetCalibTrimming(64);
  LL_RCC_SetHSIDiv(LL_RCC_HSI_DIV_1);
  /* Set AHB prescaler*/
  LL_RCC_SetAHBPrescaler(LL_RCC_HCLK_DIV_1);

  /* Sysclk activation on the HSI */
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSI);
  while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSI)
  {
  }

  /* Set APB1 prescaler*/
  LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_1);
  LL_Init1msTick(48000000);
  /* Update CMSIS variable (which can be updated also through SystemCoreClockUpdate function) */
  LL_SetSystemCoreClock(48000000);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
   /* User can add his own implementation to report the HAL error return state */
   __disable_irq();
   while (1)
   {
   }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
   /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
